---
kind: other
id: Events.T:Autodesk.Revit.UI.UIApplication
source: html/f5d59bc1-bdcc-942e-2f72-02a86f1dbd00.htm
---
# UIApplication Events

Subscribe to the ApplicationClosing event to be notified when the Revit application is just about to be closed.